<template>
  <div class="my-history-block">
    <img class="my-history-photo" src="../assets/Home/Sanya2.png" alt="">
    <div class="my-history-text">
      <h1>Моя история</h1>
      <h2>Меня зовут Санька</h2>
      <p>___________________</p>
      <p>
        Однаждый я, Санька, решила попробовать себя в чем-то необычном. Зачем выбирать между хлебом и кунг-фу, если можно объединить их? Ведь оба требуют гибкости и силы!
      </p>
      <p>
        Так я попала под чуткое кулинарное крыло мастера по имени Сенсей Кулинар. Теперь каждый мой рывок с тестом — как танец в кулинарной ритмике.
      </p>
      <p>
        Но веселье начинается, когда я пытаюсь приготовить хлеб, используя пекарские приемы и невидимые удары из кунг-фу. Теперь я — не только пекарь, но и настоящая кулинарная ниндзя!
      </p>
      <p>
        Тесто летает в воздухе, словно стрелы, а каждый удар — настоящее кулинарное искусство. Так что в моем мире, где тесто и кунг-фу соединены, я покоряю булочки и сражаюсь с вкусом одновременно! ✨🍞🥋
      </p>
    </div>
  </div>

</template>

<script>
</script>

<style scoped>
.my-history-block {
  display: flex;
  justify-content: center;
  align-items: center;
  background: linear-gradient(90deg, rgba(253,248,250,1) 93%, rgba(253,249,251,1) 94%, rgba(254,251,252,1) 97%, rgba(255,255,255,1) 100%);
  height: 500px;
  width: 100vw;

}

.my-history-photo {
  height: 430px;
  margin: 20px;
}
h1, h2 {

}
.my-history-text {
  max-width: 400px;
  height: 650px;
  text-align: center;
  word-wrap: break-word;
  font-size: 13px;
  color: #464545;
  font-family: 'Indie+Flower', cursive;
  margin-top: 150px;
}
</style>
