<template>
  <div class="container-fluid">
    <div class="row">
      <div class="col-md-6">
        <img class="my-history-photo" src="../assets/Home/Sanya2.png" alt="">
      </div>
      <div class="col-md-6">
        <div class="col-md-12">
          <div class="my-history-text">
            <h1>Моя история</h1>
            <h2>Меня зовут Санька</h2>
            <p>___________________</p>
            <p>
              Однаждый я, Санька, решила попробовать себя в чем-то необычном. Зачем выбирать между хлебом и кунг-фу,
              если можно объединить их? Ведь оба требуют гибкости и силы!
            </p>
            <p>
              Так я попала под чуткое кулинарное крыло мастера по имени Сенсей Кулинар. Теперь каждый мой рывок с тестом
              — как танец в кулинарной ритмике.
            </p>
            <p>
              Но веселье начинается, когда я пытаюсь приготовить хлеб, используя пекарские приемы и невидимые удары из
              кунг-фу. Теперь я — не только пекарь, но и настоящая кулинарная ниндзя!
            </p>
            <p>
              Тесто летает в воздухе, словно стрелы, а каждый удар — настоящее кулинарное искусство. Так что в моем
              мире, где тесто и кунг-фу соединены, я покоряю булочки и сражаюсь с вкусом одновременно! ✨🍞🥋
            </p>

          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<style scoped>


.container-fluid {
background: white !important;
}

.my-history-photo {
  width: 90%;
  margin-left: 50px;
  padding: 50px;
}

.my-history-text {
  font-size: 15px;
  color: #464545;
  font-family: 'Indie+Flower', cursive;
  padding: 50px;
  text-align: justify;
}

/* Медиа-запрос для маленьких экранов */
@media (max-width: 767px) {
  .my-history-photo {
    width: 100%; /* 100% ширины на маленьких экранах */
    margin-left: 0; /* Убираем отступ на маленьких экранах */
  }

  .my-history-text {
    margin-right: 0; /* Убираем отступ справа на маленьких экранах */
    font-size: 12px; /* Уменьшаем размер шрифта на маленьких экранах */
  }
}
</style>
